In [10]:
import sqlite3
from sqlite3 import Error
import pandas as pd

In [46]:
db_file = "sqlite_db_pythonsqlite.db"

In [55]:
# Q10: Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members! 

query10 = "SELECT name, revenue FROM ( SELECT fc.name, SUM(CASE WHEN memid = 0 THEN slots*fc.guestcost ELSE slots*fc.membercost END) AS revenue FROM Bookings AS bk INNER JOIN Facilities AS fc ON bk.facid = fc.facid GROUP BY fc.name) AS AGG WHERE revenue < 1000 ORDER BY revenue"

conn = sqlite3.connect(db_file)

cur = conn.cursor()
cur.execute(query10)
rows = cur.fetchall()
    
df10 = pd.read_sql_query(query10, conn)
print(df10)

            name  revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [58]:
# Q11: Produce a report of members and who recommended them in alphabetic surname, firstname order

query11 = "SELECT m.surname, m.firstname, p.recommendedby, p.surname, p.firstname FROM Members AS m LEFT JOIN Members AS p ON p.recommendedby = m.memid WHERE p.recommendedby != 0 ORDER BY m.surname, m.firstname"

cur = conn.cursor()
cur.execute(query11)
rows = cur.fetchall()
    
df11 = pd.read_sql_query(query11, conn)
print(df11)

     surname  firstname recommendedby            surname  firstname
0      Bader   Florence            15             Sarwin  Ramnaresh
1      Baker    Timothy            16             Coplin       Joan
2    Butters     Gerald             5            Genting    Matthew
3    Farrell     Jemima            13              Baker    Timothy
4    Farrell     Jemima            13             Pinker      David
5    Genting    Matthew            20             Rumney  Henrietta
6      Jones      David            11              Jones    Douglas
7   Joplette     Janice             4               Dare      Nancy
8   Joplette     Janice             4              Jones      David
9    Purview  Millicent            30               Hunt       John
10    Rownam        Tim             3             Boothe        Tim
11     Smith     Darren             1           Joplette     Janice
12     Smith     Darren             1            Butters     Gerald
13     Smith     Darren             1               Owen    Charles
14     Smith     Darren             1              Smith       Jack
15     Smith     Darren             1          Mackenzie       Anna
16     Smith      Tracy             2  Worthington-Smyth      Henry
17     Smith      Tracy             2            Purview  Millicent
18     Smith      Tracy             2            Crumpet      Erica
19  Stibbons     Ponder             9              Baker       Anne
20  Stibbons     Ponder             9              Bader   Florence
21     Tracy     Burton             6           Stibbons     Ponder

In [64]:
# Q12: Find the facilities with their usage by member, but not guests

query12 = "SELECT f.name, COUNT(sub.memid) AS Facility_Usage FROM (SELECT facid, memid FROM Bookings WHERE memid != 0) AS sub LEFT JOIN Facilities AS f ON sub.facid = f.facid GROUP BY sub.facid"

cur = conn.cursor()
cur.execute(query12)
rows = cur.fetchall()
    
df12 = pd.read_sql_query(query12, conn)
print(df12)

              name  Facility_Usage
0   Tennis Court 1             308
1   Tennis Court 2             276
2  Badminton Court             344
3     Table Tennis             385
4   Massage Room 1             421
5   Massage Room 2              27
6     Squash Court             195
7    Snooker Table             421
8       Pool Table             783

In [74]:
# Q13: Find the facilities usage by month, but not guests

query13 = "SELECT f.name, COUNT(sub.memid) AS Facility_Usage, month FROM (SELECT facid, memid, strftime('%m', starttime) AS month FROM Bookings WHERE memid != 0) AS sub LEFT JOIN Facilities AS f ON sub.facid = f.facid GROUP BY month;"


cur = conn.cursor()
cur.execute(query13)
rows = cur.fetchall()
    
df13 = pd.read_sql_query(query13, conn)
print(df13)

             name  Facility_Usage month
0    Table Tennis             480    07
1  Tennis Court 1            1168    08
2  Tennis Court 1            1512    09